[
    {
        "slug": "ama",
        "title": "Aalborg Martial Arts",
        "techs": [3,5,7],
        "roles": [2,3],
        "links": {
            "ext": "https://mmd3-ama.vercel.app/#/",
            "git": "https://github.com/AndersErikNissen/MMD3"
        },
        "year": 2021,
        "mood_img": "ama_mood.png",
        "logo": "logo_ama.svg",
        "color": "#EC0000",
        "about_case": "Aalborg Martial Arts (AMA) er en mixed martial arts klub med beliggenhed i Aalborg centrum og tilbyder mange forskellige kampsports hold. De har mange undervisere og medlemmer som er engagerede i klubben, dette skyldes blandt andet at klubben lægger stor vægt på at have et aktivt og sundt miljø for deres medlemmer. De trængte til en ny hjemmeside, som kan rumme de mange ting de råder over.",
        "content": [
            {
                "text": "Udfordringen ved den daværende hjemmeside var at den var bygget med et standard WordPress tema som ikke var blevet opdateret, så meget information manglede eller var svær at finde. Siden at AMA tilbyder hold til forskellige typer af kampsport samt aldersgrupper, betød det at det hurtigt kunne blive uoverskuelig for en ny bruger af hjemmesiden. Derfor var det også vigtigt for vores gruppe at få indsamlet kvalitativ data fra både nuværende men også potentielle nye medlemmer. Design Thinking blev anvendt siden vi arbejdede med en iterativ og agil process under hele projektet.",
                "img": ""
            },
             {
                "text": "Forinden design delen kunne blive påbegyndt blev forskellige UX metoder anvendt til at skabe et godt fundament at bygge designet på. Her blev metoder som OOUX og User Stories brugt til at kunne bedst muligt anvende den indsamlede kvalitative data. På grund af at tidsplanen havde skredet under projektet, medførte det at vi ikke havde meget tid til designet. Det gjorde at jeg ikke kunne være meget med i designprocessen fordi jeg arbejde på at opbygge grundstrukturen for koden samt backenden. Jeg var mest en sparringspartner under designprocessen samt jeg arbejde på nogle af de mindre designelementer.",
                "img": ""
            },
            {
                "text": "Jeg ville gerne have mere erfaring med Vue.js, så jeg foreslog at jeg udviklede hjemmesiden med Vue.js og så anvendte et CMS til alt dataen, og det synes de var en god ide. Jeg valgte at anvende Strapi som CMS siden det havde gode anmeldelser og havde en udmærket dokumentation og guides. Jeg valgte at først finde ud af hvordan data skulle opsættes i Strapi og hvordan jeg kunne gøre det nemmest for kunden og gruppemedlemmer at oprette nyt data. </br></br>Nogle af de sværeste ting at udvikle på hjemmesiden udover at lave API kald og checke på hver side om den rette data kunne findes, var at skabe kalendersystemer. Hjemmesiden skulle have en event side, som viste forskellige events og der var en kalender side med de forskellige ugentlige aktiviteter som var den sværest at udvikle. Grunden til det var at opsætningen af et system som ville give det rette grid-område til en aktivitet var tidskrævende, ydermere var det svært med JS at omforme datoerne så aktiviteterne kom kronologisk. </br></br>På samme tid som projektet udviklede jeg også denne side som du ser på lige nu, og gjorde at når jeg fandt ny læring på et projekt kunne jeg anvende det på det andet. Det medførte også at under hele forløbet fik jeg god erfaring inden for Vue.js og generelt mere erfaring med at arbejde med API i forskellige udformninger.",
                "img": "ama_process.png"
            }
        ]
    },
    {
        "slug": "movie-wizard",
        "title": "Movie Wizard",
        "techs": [3,5,6],
        "roles": [0,2,3],
        "links": {
            "ext": "https://wizard-movie-project.vercel.app/#/",
            "git": "https://github.com/AndersErikNissen/wizard-movie-project"
        },
        "year": 2021,
        "mood_img": "wizardmovies_mood.png",
        "logo": "logo_wizard.svg",
        "color": "#00EACE",
        "about_case": "Som en del af processen for, at have en chance for at komme i praktik hos WEXO A/S skulle jeg lave en hjemmeside, som skulle arbejde sammen med en Open-source API. API leverer information omkring film og serier, og derfor var kravet at produktet skulle være en hjemmesiden som ville minde om f.eks. IMDB. For at kunne bedre fordybe mig i projektet valgte jeg at komme op med ideen om at kalde projektet “Wizard Movies”, som ville være inspirationen til designet.</br></br>Jeg skulle også give WEXO A/S et bud på hvor længe jeg ville tage om at lave løsningen, jeg valgte at sige 20 timer, hvilket dog var alt for lavt i og med at jeg endte med at bruge omkring 45 timer. Der var mange faktorer som spillede ind på den store overskridelse, blandt andet at jeg kodede hjemmesiden med Vue.js, hvilket jeg kun lige havde lært lidt om i skolen, samt at det vidste sig at være svært at arbejde med API’en.",
        "content": [
            {
                "text": "Som en del af opgaven blev forskellige krav stillet til produktet: der skulle være en forside som skulle fremvise hver film fra hver kategori, en side som fremviste alle film fra en bestemt kategori, en side som skulle fremvise information om den enkelte film og til sidst skulle der være en side som skulle fremvise brugernes favorit film ( Ved brug af Local Storage eller andet ).",
                "img": ""
            },
             {
                "text": "Jeg endte med at skabe designet efter at jeg havde kodet alt funktionalitet, grundet at jeg havde en tidsramme og jeg vidste at det vigtigste var at få styr på alt kode og funktionalitet inden. Jeg valgte dog at selvom jeg overskred mit tidsbegrænsning, at jeg ville give den gas med at komme frem til at et fedt design. Som det første lavede jeg en simpel konkurrentanalyse for at forstå hvordan andre hjemmesider arbejdede med design samt opsætningen af alt dataen.</br></br>Jeg valgte selv at skabe designelementer i form af SVG’er via Adobe Illustrator, som blev brugt rundt omkring på hjemmesiden for at give den mere karakter. Det første jeg lavede var troldmand logoet, som fik nogle udvidede versioner som skulle bruges steder som på 404-siden, ikoner til ting som datoen for film udgivelsen og ellers lavede jeg gryden med bobler på forsiden samt en simpel baggrund med lyn. Jeg lavede animationer til en del af elementerne, hvilket blev gjort med CSS-kode. </br></br>Som designet skred frem kom jeg også frem til de forskellige farver som skulle anvendes, ved at finde forskellige kontrastfarver som ville kunne arbejde sammen. Jeg valgte at skabe designet i koden i stedet for at anvende Figma / Adobe XD for at spare tid og nemmere kunne se, hvordan designet så ud i aktion.",
                "img": ""
            },
            {
                "text": "Store dele af udviklingens processen gik med at arbejde med den udleverede API, som viste sig at være meget ustabil i mængden af data som blev leveret, som jeg tror har været en del af formålet. Det betød nemlig at jeg måtte arbejde med at først forstå data strukturen, og bagefter checke, hvor der var mangler i dataen for at kunne opsætte kode, som kunne håndtere at dataen ikke altid blevet leveret. Det kan blandt andet ses ved de billedformater som leveres til hver film, hvor jeg måtte skabe kode som brugte et “placeholder” billede hvis billedet ikke blev leveret i det rette format. Når det kom til at opsætte stylingen af hjemmesiden valgte jeg på forsiden at anvende horisontal scrolling til at fremvise hver kategori, det havde også til formål at mindske højden af selve siden og stadig vise meget indhold. Menuen blev lavet som en hamburger menu selv på desktop for at mindske omfanget, og jeg valgte at skippe en animation på menuen for igen at spare på tiden. Som det sidste opsatte jeg funktionaliteten, for at brugeren kunne tilføje og fjerne film fra favoritlisten.",
                "img": "movie-wizard_process.png"
            }
        ]
    },
    {
        "slug": "toolbox",
        "title": "Toolbox",
        "techs": [0,1,2,8],
        "roles": [3],
        "links": {
            "ext": "https://toolbox-alpha.vercel.app/",
            "git": "https://github.com/MLousdal/Toolbox"
        },
        "year": 2021,
        "mood_img": "toolbox_mood.png",
        "logo": "logo_toolbox.svg",
        "color": "#0057FF",
        "about_case": "På 3. semester på studiet havde vi i en måned valgfag, hvor jeg valgte Web API, som havde til formål at give læring omkring API’er samt backenden. Til sidst i forløbet havde vi en gruppeeksamen hvor vi skulle lave en backend og frontend som skulle arbejde sammen. Vi havde frit valg i temaet for vores hjemmeside, hvor vi i min gruppe valgte at lave en hjemmeside, hvor det var muligt at videre dele tool/værktøjer til forskellige teknologi emner.",
        "content": [
            {
                "text": "I min gruppe var det mig som stod for at opsætte backenden, som blev gjort med Node.js og Express i samarbejde med vores studies MSSQL server. Det betød at jeg kom til at arbejde med at opsætte data strukturen. Meget af de store udfordringer for mig var at arbejde med MSSQL samt at forstå, hvordan jeg bedst muligt checkede forespørgsler og videre gav det rette information til hver request.",
                "img": ""
            },
             {
                "text": "Designet for vores produkt blev meget enkelt, den havde en forside med alt information, en login / oprette bruger side og til sidst en side, som blev brugt når brugeren havde logget ind. Designet af MSSQL strukturen tog lang tid fordi det var svært at finde den rette måde at opsætte forholdene mellem de forskellige typer af data, som også skulle udspecificeres.",
                "img": ""
            },
            {
                "text": "Det først som jeg gik i gang med var at arbejde på database delen via MSSQL, og bagefter få opsat en forbindelse mellem databasen og backenden som jeg var ved at udvikle. Jeg opsatte forskellige routes, så det tog mig noget tid at finde ud af rækkefølgen de skulle opsættes i samt, hvordan jeg skulle opsætte middleware til de routes som krævede at brugeren var logget ind. Ellers brugte jeg tiden på at opsætte hver router med hvordan de skulle hente data fra databasen, samt hvordan indholdet skulle checkes, opsættes og til sidst sendes tilbage. Under processen var det også vigtigt at snakke sammen med gruppen omkring hvilke krav og behov frontenden havde, så jeg kunne justere backenden til at leve op til de behov. Hele projektet var en stor udfordring for mig, siden jeg aldrig havde prøvet at arbejde med en database eller skabe en API fra bunden af, men det var en fed udfordring og det var sejt da vi til sidst fik frontenden og backenden til at arbejde sammen.",
                "img": "toolbox_process.png"
            }
        ]
    },
    {
        "slug": "pinktree",
        "title": "Pinktree",
        "techs": [0,1,2],
        "roles": [0,1,2,3],
        "links": {
            "ext": "https://mini-pink-tree.vercel.app/",
            "git": "https://github.com/AndersErikNissen/mini_pinkTree"
        },
        "year": 2021,
        "mood_img": "pinktree_mood.png",
        "logo": "logo_pinktree.svg",
        "color": "#EA3F73",
        "about_case": "Pinktree er et lille mini projekt jeg lavede i min sommerferie i 2021, som havde til formål, at jeg gerne ville have mere erfaring med Javascript. Hen over sommeren havde jeg også opdaget det som kaldes Shadow DOM og komponenter. Som går ud på hvordan det er muligt at lave elementer af kode som er uafhængige og kan fungere for sig selv uden af blive påvirket af andet kode. Senere på året lærte jeg om Single-page Applications i form af Vue.js, så der var det spændende og rart at jeg allerede have lidt indblik i, hvordan jeg selv ville kunne lave uafhængig kode.",
        "content": [
            {
                "text": "Projektet gik ud på at jeg lavede noget Vector-grafik som jeg gerne ville prøve at animere. Derfor tænkte jeg, hvorfor ikke også lave en hjemmeside som kunne anvende denne grafik? På samme tidspunkt havde jeg interesse for at arbejde og prøve at arbejde med at lave en hjemmeside med formålet om at holde på noter, og på samme tid anvende Local Storage.",
                "img": ""
            },
             {
                "text": "I og med at der ikke var nogen kunde at arbejde sammen med havde jeg frit spil i, hvordan hjemmesiden skulle se ud. Jeg valgte at lave designet imens jeg lavede funktionaliteten til hjemmesiden, og de farver som blev valgt var ud fra det tidligere Vector-design. Designet var meget en iterative proces, og på et tidspunkt opstod ideen om at brugeren ville kunne lave designet. Hermed arbejdede jeg på to forskellige designs samt to forskellige farvetemaer som brugeren kunne vælge imellem.",
                "img": ""
            },
            {
                "text": "Mit formål med koden var at kun anvende en HTML dokument og udskifte alt indholdet med Javascript. Jeg kom til at arbejde med at ændre indhold alt efter hvad brugeren valgte i forhold til design og farver, hvilket var en meget lærerig proces. Efter jeg havde fået sat det op, sådan at indholdet kunne blive skiftet ud i en bestemt rækkefølge, begyndte jeg at arbejde med de forskellige transitions og animationer som skulle ske ind i mellem hver skift. Til sidst valgte jeg at arbejde med at opsætte Note-indholdet, og arbejde med at Local Storage for at brugeren ville kunne se deres noter næste gang de brugte hjemmesiden. Det var min plan at valg af hjemmeside udseendet skulle blive gemt, men jeg valgte at skippe den del siden jeg snart skulle begynde på 3. semester.",
                "img": "pinktree_process.png"
            }
        ]
    }
]